In [1]:
import pyspark
from pyspark.sql import SparkSession
import os, sys

spark = SparkSession.builder.master('local[*]').getOrCreate()

In [2]:
os.environ['PYSPARK_DRIVER_PYTHON_OPTS']= "notebook"
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable
os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['HADOOP_HOME'] = "C:\\apps\hadoop"
os.environ['SPARK_HOME'] = "C:\\apps\spark-3.5.0-bin-hadoop3"

# Spark SQL

In [3]:
df = spark.sql('''select "OK" as Status''')
df.show()

+------+
|Status|
+------+
|    OK|
+------+

# Import data

In [4]:
df = spark.read.csv('./cereal.csv', sep=',', inferSchema=True, header=True)

print(f'Lines: {df.count()}')
df.show(10)

Lines: 77
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|                name|mfr|type|calories|protein|fat|sodium|fiber|carbo|sugars|potass|vitamins|shelf|weight|cups|   rating|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|           100% Bran|  N|   C|      70|      4|  1|   130| 10.0|  5.0|     6|   280|      25|    3|   1.0|0.33|68.402973|
|   100% Natural Bran|  Q|   C|     120|      3|  5|    15|  2.0|  8.0|     8|   135|       0|    3|   1.0| 1.0|33.983679|
|            All-Bran|  K|   C|      70|      4|  1|   260|  9.0|  7.0|     5|   320|      25|    3|   1.0|0.33|59.425505|
|All-Bran with Ext...|  K|   C|      50|      4|  0|   140| 14.0|  8.0|     0|   330|      25|    3|   1.0| 0.5|93.704912|
|      Almond Delight|  R|   C|     110|      2|  2|   200|  1.0| 14.0|     8|    -1|      25|    3|   1.0|0.75|34.384843|
|Apple Cinnamon Ch...|  G|   C|     110|      2|  2|   180|  1.5| 10.5|    10|    70|      25|    1|   1.0|0.75|29.509541|
|         Apple Jacks|  K|   C|     110|      2|  0|   125|  1.0| 11.0|    14|    30|      25|    2|   1.0| 1.0|33.174094|
|             Basic 4|  G|   C|     130|      3|  2|   210|  2.0| 18.0|     8|   100|      25|    3|  1.33|0.75|37.038562|
|           Bran Chex|  R|   C|      90|      2|  1|   200|  4.0| 15.0|     6|   125|      25|    1|   1.0|0.67|49.120253|
|         Bran Flakes|  P|   C|      90|      3|  0|   210|  5.0| 13.0|     5|   190|      25|    3|   1.0|0.67|53.313813|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
only showing top 10 rows

In [5]:
df.printSchema()

root
 |-- name: string (nullable = true)
 |-- mfr: string (nullable = true)
 |-- type: string (nullable = true)
 |-- calories: integer (nullable = true)
 |-- protein: integer (nullable = true)
 |-- fat: integer (nullable = true)
 |-- sodium: integer (nullable = true)
 |-- fiber: double (nullable = true)
 |-- carbo: double (nullable = true)
 |-- sugars: integer (nullable = true)
 |-- potass: integer (nullable = true)
 |-- vitamins: integer (nullable = true)
 |-- shelf: integer (nullable = true)
 |-- weight: double (nullable = true)
 |-- cups: double (nullable = true)
 |-- rating: double (nullable = true)

# Manipulate date with Spark SQL

In [6]:
df.createOrReplaceTempView('cereal_sql')

In [7]:
df_cereal = spark.sql('''SELECT * FROM cereal_sql''')
df_cereal.show(5)

+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|                name|mfr|type|calories|protein|fat|sodium|fiber|carbo|sugars|potass|vitamins|shelf|weight|cups|   rating|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|           100% Bran|  N|   C|      70|      4|  1|   130| 10.0|  5.0|     6|   280|      25|    3|   1.0|0.33|68.402973|
|   100% Natural Bran|  Q|   C|     120|      3|  5|    15|  2.0|  8.0|     8|   135|       0|    3|   1.0| 1.0|33.983679|
|            All-Bran|  K|   C|      70|      4|  1|   260|  9.0|  7.0|     5|   320|      25|    3|   1.0|0.33|59.425505|
|All-Bran with Ext...|  K|   C|      50|      4|  0|   140| 14.0|  8.0|     0|   330|      25|    3|   1.0| 0.5|93.704912|
|      Almond Delight|  R|   C|     110|      2|  2|   200|  1.0| 14.0|     8|    -1|      25|    3|   1.0|0.75|34.384843|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
only showing top 5 rows

In [8]:
filter = spark.sql('''SELECT * FROM cereal_sql WHERE type = "C"''')
print(f'Lines: {filter.count()}')
filter.show(5)

Lines: 74
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|                name|mfr|type|calories|protein|fat|sodium|fiber|carbo|sugars|potass|vitamins|shelf|weight|cups|   rating|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|           100% Bran|  N|   C|      70|      4|  1|   130| 10.0|  5.0|     6|   280|      25|    3|   1.0|0.33|68.402973|
|   100% Natural Bran|  Q|   C|     120|      3|  5|    15|  2.0|  8.0|     8|   135|       0|    3|   1.0| 1.0|33.983679|
|            All-Bran|  K|   C|      70|      4|  1|   260|  9.0|  7.0|     5|   320|      25|    3|   1.0|0.33|59.425505|
|All-Bran with Ext...|  K|   C|      50|      4|  0|   140| 14.0|  8.0|     0|   330|      25|    3|   1.0| 0.5|93.704912|
|      Almond Delight|  R|   C|     110|      2|  2|   200|  1.0| 14.0|     8|    -1|      25|    3|   1.0|0.75|34.384843|
+--------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
only showing top 5 rows

# Counting lines as new column

In [9]:
filter = spark.sql('''SELECT COUNT(*) AS total FROM cereal_sql WHERE mfr = "K"''')
filter.show()

+-----+
|total|
+-----+
|   23|
+-----+

# Variações do comando Select

In [10]:
# Colunas específicas
cereal = spark.sql('''SELECT name,type,mfr FROM cereal_sql ''')
cereal.show(5)

+--------------------+----+---+
|                name|type|mfr|
+--------------------+----+---+
|           100% Bran|   C|  N|
|   100% Natural Bran|   C|  Q|
|            All-Bran|   C|  K|
|All-Bran with Ext...|   C|  K|
|      Almond Delight|   C|  R|
+--------------------+----+---+
only showing top 5 rows

In [11]:
# Valores distintos
cereal = spark.sql('''SELECT type,mfr FROM cereal_sql ''')
print(f'Lines: {cereal.count()}')
cereal.show(5)

cereal = spark.sql('''SELECT DISTINCT type,mfr FROM cereal_sql ''')
print(f'Lines: {cereal.count()}')
cereal.show(5)

Lines: 77
+----+---+
|type|mfr|
+----+---+
|   C|  N|
|   C|  Q|
|   C|  K|
|   C|  K|
|   C|  R|
+----+---+
only showing top 5 rows

Lines: 9
+----+---+
|type|mfr|
+----+---+
|   C|  P|
|   C|  Q|
|   C|  N|
|   H|  Q|
|   C|  R|
+----+---+
only showing top 5 rows

# Comando Where

In [12]:
cereal = spark.sql('''SELECT DISTINCT type,mfr FROM cereal_sql WHERE type = "C"''')
print(f'Lines: {cereal.count()}')
cereal.show(5)

Lines: 6
+----+---+
|type|mfr|
+----+---+
|   C|  P|
|   C|  Q|
|   C|  N|
|   C|  R|
|   C|  G|
+----+---+
only showing top 5 rows

In [13]:
# Dupla condição
cereal = spark.sql('''SELECT * FROM cereal_sql WHERE mfr = "K" AND calories >= 100''')
print(f'Lines: {cereal.count()}')
cereal.show(5)

Lines: 19
+------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|              name|mfr|type|calories|protein|fat|sodium|fiber|carbo|sugars|potass|vitamins|shelf|weight|cups|   rating|
+------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
|       Apple Jacks|  K|   C|     110|      2|  0|   125|  1.0| 11.0|    14|    30|      25|    2|   1.0| 1.0|33.174094|
|       Corn Flakes|  K|   C|     100|      2|  0|   290|  1.0| 21.0|     2|    35|      25|    1|   1.0| 1.0|45.863324|
|         Corn Pops|  K|   C|     110|      1|  0|    90|  1.0| 13.0|    12|    20|      25|    2|   1.0| 1.0|35.782791|
|Cracklin' Oat Bran|  K|   C|     110|      3|  3|   140|  4.0| 10.0|     7|   160|      25|    3|   1.0| 0.5|40.448772|
|           Crispix|  K|   C|     110|      2|  0|   220|  1.0| 21.0|     3|    30|      25|    3|   1.0| 1.0|46.895644|
+------------------+---+----+--------+-------+---+------+-----+-----+------+------+--------+-----+------+----+---------+
only showing top 5 rows

# Groupby

In [14]:
# Agrupamento simples
cereal = spark.sql(''' SELECT mfr,type,COUNT(*) AS count FROM cereal_sql GROUP BY mfr,type''')
cereal.show()

+---+----+-----+
|mfr|type|count|
+---+----+-----+
|  A|   H|    1|
|  P|   C|    9|
|  K|   C|   23|
|  G|   C|   22|
|  Q|   C|    7|
|  R|   C|    8|
|  Q|   H|    1|
|  N|   H|    1|
|  N|   C|    5|
+---+----+-----+

In [15]:
# Agrupamento com mais de uma agregação
cereal = spark.sql(''' SELECT mfr,type,COUNT(*) AS count, SUM(calories) as total_calories FROM cereal_sql GROUP BY mfr,type''')
cereal.show()

+---+----+-----+--------------+
|mfr|type|count|total_calories|
+---+----+-----+--------------+
|  A|   H|    1|           100|
|  P|   C|    9|           980|
|  K|   C|   23|          2500|
|  G|   C|   22|          2450|
|  Q|   C|    7|           660|
|  R|   C|    8|           920|
|  Q|   H|    1|           100|
|  N|   H|    1|           100|
|  N|   C|    5|           420|
+---+----+-----+--------------+

In [16]:
# Agrupamento com mais de uma agregação
cereal = spark.sql(''' SELECT \
                           mfr, type, COUNT(*) AS count, SUM(calories) as total_calories \
                       FROM cereal_sql\
                       GROUP BY mfr,type''')
cereal.show()

+---+----+-----+--------------+
|mfr|type|count|total_calories|
+---+----+-----+--------------+
|  A|   H|    1|           100|
|  P|   C|    9|           980|
|  K|   C|   23|          2500|
|  G|   C|   22|          2450|
|  Q|   C|    7|           660|
|  R|   C|    8|           920|
|  Q|   H|    1|           100|
|  N|   H|    1|           100|
|  N|   C|    5|           420|
+---+----+-----+--------------+

# CASE WHEN

In [17]:
cereal = spark.sql(''' SELECT DISTINCT\
                           type \
                       FROM cereal_sql''')
cereal.show()

+----+
|type|
+----+
|   C|
|   H|
+----+

In [18]:
cereal = spark.sql(''' SELECT\
                           mfr, type, (case when type = "C" then "tipo C" else "tipo H" end) as category, count(*) as count \
                       FROM cereal_sql\
                       GROUP BY mfr, type''')
cereal.show()

+---+----+--------+-----+
|mfr|type|category|count|
+---+----+--------+-----+
|  A|   H|  tipo H|    1|
|  P|   C|  tipo C|    9|
|  K|   C|  tipo C|   23|
|  G|   C|  tipo C|   22|
|  Q|   C|  tipo C|    7|
|  R|   C|  tipo C|    8|
|  Q|   H|  tipo H|    1|
|  N|   H|  tipo H|    1|
|  N|   C|  tipo C|    5|
+---+----+--------+-----+

In [19]:
# Células comentadas em SQL
cereal = spark.sql(''' SELECT
                           mfr, type,
                           (case
                                when type = "C" then "tipo C"
                                --when type = "H" then "tipo B"
                                --else "tipo H"
                           end) as category,
                           count(*) as count 
                       FROM cereal_sql
                       GROUP BY mfr, type''')
cereal.show()

+---+----+--------+-----+
|mfr|type|category|count|
+---+----+--------+-----+
|  A|   H|    NULL|    1|
|  P|   C|  tipo C|    9|
|  K|   C|  tipo C|   23|
|  G|   C|  tipo C|   22|
|  Q|   C|  tipo C|    7|
|  R|   C|  tipo C|    8|
|  Q|   H|    NULL|    1|
|  N|   H|    NULL|    1|
|  N|   C|  tipo C|    5|
+---+----+--------+-----+

# Consultas avançadas

In [20]:
cereal = spark.sql('''  SELECT mfr, type,
                                sum(calories) as sum_calories,
                                min(calories) as min_calories,
                                max(calories) as max_calories,
                                avg(calories) as avg_calories,
                                count(name) as count
                        FROM cereal_sql
                        GROUP BY mfr,type
                        ORDER BY count DESC

''')

cereal.show()

+---+----+------------+------------+------------+------------------+-----+
|mfr|type|sum_calories|min_calories|max_calories|      avg_calories|count|
+---+----+------------+------------+------------+------------------+-----+
|  K|   C|        2500|          50|         160|108.69565217391305|   23|
|  G|   C|        2450|         100|         140|111.36363636363636|   22|
|  P|   C|         980|          90|         120|108.88888888888889|    9|
|  R|   C|         920|          90|         150|             115.0|    8|
|  Q|   C|         660|          50|         120| 94.28571428571429|    7|
|  N|   C|         420|          70|          90|              84.0|    5|
|  A|   H|         100|         100|         100|             100.0|    1|
|  Q|   H|         100|         100|         100|             100.0|    1|
|  N|   H|         100|         100|         100|             100.0|    1|
+---+----+------------+------------+------------+------------------+-----+

In [21]:
cereal = spark.sql('''  SELECT mfr, type,
                                sum(calories) as sum_calories,
                                min(calories) as min_calories,
                                max(calories) as max_calories,
                                avg(calories) as avg_calories,
                   
                                sum(carbo) as sum_carbo,
                                min(carbo) as min_carbo,
                                max(carbo) as max_carbo,
                                avg(carbo) as avg_carbo,
                   
                                sum(vitamins) as sum_vitamins,
                                min(vitamins) as min_vitamins,
                                max(vitamins) as max_vitamins,
                                avg(vitamins) as avg_vitamins,
                   
                                count(name) as count
                        FROM cereal_sql
                        GROUP BY mfr,type
                        ORDER BY count DESC

''')

cereal.show()

+---+----+------------+------------+------------+------------------+---------+---------+---------+------------------+------------+------------+------------+------------------+-----+
|mfr|type|sum_calories|min_calories|max_calories|      avg_calories|sum_carbo|min_carbo|max_carbo|         avg_carbo|sum_vitamins|min_vitamins|max_vitamins|      avg_vitamins|count|
+---+----+------------+------------+------------+------------------+---------+---------+---------+------------------+------------+------------+------------+------------------+-----+
|  K|   C|        2500|          50|         160|108.69565217391305|    348.0|      7.0|     22.0|15.130434782608695|         800|          25|         100| 34.78260869565217|   23|
|  G|   C|        2450|         100|         140|111.36363636363636|    324.0|     10.5|     21.0|14.727272727272727|         775|          25|         100| 35.22727272727273|   22|
|  P|   C|         980|          90|         120|108.88888888888889|    119.0|     11.0|     17.0|13.222222222222221|         225|          25|          25|              25.0|    9|
|  R|   C|         920|          90|         150|             115.0|    141.0|     14.0|     23.0|            17.625|         200|          25|          25|              25.0|    8|
|  Q|   C|         660|          50|         120| 94.28571428571429|     81.0|      8.0|     14.0|11.571428571428571|         100|           0|          25|14.285714285714286|    7|
|  N|   C|         420|          70|          90|              84.0|     75.0|      5.0|     20.0|              15.0|          50|           0|          25|              10.0|    5|
|  A|   H|         100|         100|         100|             100.0|     16.0|     16.0|     16.0|              16.0|          25|          25|          25|              25.0|    1|
|  Q|   H|         100|         100|         100|             100.0|     -1.0|     -1.0|     -1.0|              -1.0|           0|           0|           0|               0.0|    1|
|  N|   H|         100|         100|         100|             100.0|     21.0|     21.0|     21.0|              21.0|           0|           0|           0|               0.0|    1|
+---+----+------------+------------+------------+------------------+---------+---------+---------+------------------+------------+------------+------------+------------------+-----+

# Formatação de colunas

In [22]:
# Formatação de valores decimais
cereal = spark.sql('''  SELECT mfr, type,
                                sum(calories) as sum_calories,
                                min(calories) as min_calories,
                                max(calories) as max_calories,
                                cast(avg(calories) as decimal(10,2)) as avg_calories,
                   
                                sum(carbo) as sum_carbo,
                                min(carbo) as min_carbo,
                                max(carbo) as max_carbo,
                                cast(avg(carbo) as decimal(10,2)) as avg_carbo,
                   
                                sum(vitamins) as sum_vitamins,
                                min(vitamins) as min_vitamins,
                                max(vitamins) as max_vitamins,
                                cast(avg(vitamins) as decimal(10,2)) as avg_vitamins,
                   
                                count(name) as count
                        FROM cereal_sql
                        GROUP BY mfr,type
                        ORDER BY count DESC

''')

cereal.show()

+---+----+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+
|mfr|type|sum_calories|min_calories|max_calories|avg_calories|sum_carbo|min_carbo|max_carbo|avg_carbo|sum_vitamins|min_vitamins|max_vitamins|avg_vitamins|count|
+---+----+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+
|  K|   C|        2500|          50|         160|      108.70|    348.0|      7.0|     22.0|    15.13|         800|          25|         100|       34.78|   23|
|  G|   C|        2450|         100|         140|      111.36|    324.0|     10.5|     21.0|    14.73|         775|          25|         100|       35.23|   22|
|  P|   C|         980|          90|         120|      108.89|    119.0|     11.0|     17.0|    13.22|         225|          25|          25|       25.00|    9|
|  R|   C|         920|          90|         150|      115.00|    141.0|     14.0|     23.0|    17.63|         200|          25|          25|       25.00|    8|
|  Q|   C|         660|          50|         120|       94.29|     81.0|      8.0|     14.0|    11.57|         100|           0|          25|       14.29|    7|
|  N|   C|         420|          70|          90|       84.00|     75.0|      5.0|     20.0|    15.00|          50|           0|          25|       10.00|    5|
|  A|   H|         100|         100|         100|      100.00|     16.0|     16.0|     16.0|    16.00|          25|          25|          25|       25.00|    1|
|  Q|   H|         100|         100|         100|      100.00|     -1.0|     -1.0|     -1.0|    -1.00|           0|           0|           0|        0.00|    1|
|  N|   H|         100|         100|         100|      100.00|     21.0|     21.0|     21.0|    21.00|           0|           0|           0|        0.00|    1|
+---+----+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+

# Case When Avançado

In [23]:
# Formatação de valores decimais
cereal = spark.sql('''  SELECT mfr, type,
                                (case
                                    when mfr = "K" then "Abacaxi"
                                    when mfr = "G" then "Goiaba"
                                    when mfr = "P" then "Pera"
                                    when mfr = "R" then "Roma"
                                    when mfr = "Q" then "Espinafre"
                                    when mfr = "N" then "Nectarina"
                                    when mfr = "A" then "Abacate"
                                    else "NA"
                                end) as type_fruit,
                                sum(calories) as sum_calories,
                                min(calories) as min_calories,
                                max(calories) as max_calories,
                                cast(avg(calories) as decimal(10,2)) as avg_calories,
                   
                                sum(carbo) as sum_carbo,
                                min(carbo) as min_carbo,
                                max(carbo) as max_carbo,
                                cast(avg(carbo) as decimal(10,2)) as avg_carbo,
                   
                                sum(vitamins) as sum_vitamins,
                                min(vitamins) as min_vitamins,
                                max(vitamins) as max_vitamins,
                                cast(avg(vitamins) as decimal(10,2)) as avg_vitamins,
                   
                                count(name) as count
                        FROM cereal_sql
                        GROUP BY mfr,type
                        ORDER BY count DESC

''')

cereal.show()

+---+----+----------+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+
|mfr|type|type_fruit|sum_calories|min_calories|max_calories|avg_calories|sum_carbo|min_carbo|max_carbo|avg_carbo|sum_vitamins|min_vitamins|max_vitamins|avg_vitamins|count|
+---+----+----------+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+
|  K|   C|   Abacaxi|        2500|          50|         160|      108.70|    348.0|      7.0|     22.0|    15.13|         800|          25|         100|       34.78|   23|
|  G|   C|    Goiaba|        2450|         100|         140|      111.36|    324.0|     10.5|     21.0|    14.73|         775|          25|         100|       35.23|   22|
|  P|   C|      Pera|         980|          90|         120|      108.89|    119.0|     11.0|     17.0|    13.22|         225|          25|          25|       25.00|    9|
|  R|   C|      Roma|         920|          90|         150|      115.00|    141.0|     14.0|     23.0|    17.63|         200|          25|          25|       25.00|    8|
|  Q|   C| Espinafre|         660|          50|         120|       94.29|     81.0|      8.0|     14.0|    11.57|         100|           0|          25|       14.29|    7|
|  N|   C| Nectarina|         420|          70|          90|       84.00|     75.0|      5.0|     20.0|    15.00|          50|           0|          25|       10.00|    5|
|  A|   H|   Abacate|         100|         100|         100|      100.00|     16.0|     16.0|     16.0|    16.00|          25|          25|          25|       25.00|    1|
|  Q|   H| Espinafre|         100|         100|         100|      100.00|     -1.0|     -1.0|     -1.0|    -1.00|           0|           0|           0|        0.00|    1|
|  N|   H| Nectarina|         100|         100|         100|      100.00|     21.0|     21.0|     21.0|    21.00|           0|           0|           0|        0.00|    1|
+---+----+----------+------------+------------+------------+------------+---------+---------+---------+---------+------------+------------+------------+------------+-----+

# Joins

## InnerJoin

In [24]:
df_sales = spark.read.csv('./sales_data_sample.csv', sep=',', inferSchema=True, header=True)

print(f'Lines: {df_sales.count()}')
df_sales.show(10)

Lines: 2823
+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+-----+----------+-------+---------+---------------+----------------+--------+
|ORDERNUMBER|QUANTITYORDERED|PRICEEACH|ORDERLINENUMBER|  SALES|      ORDERDATE| STATUS|QTR_ID|MONTH_ID|YEAR_ID|PRODUCTLINE|MSRP|PRODUCTCODE|        CUSTOMERNAME|           PHONE|        ADDRESSLINE1|ADDRESSLINE2|         CITY|STATE|POSTALCODE|COUNTRY|TERRITORY|CONTACTLASTNAME|CONTACTFIRSTNAME|DEALSIZE|
+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+-----+----------+-------+---------+---------------+----------------+--------+
|      10107|             30|     95.7|              2| 2871.0| 2/24/2003 0:00|Shipped|     1|       2|   2003|Motorcycles|  95|   S10_1678|   Land of Toys Inc.|      2125557818|897 Long Airport ...|        NULL|          NYC|   NY|     10022|    USA|       NA|             Yu|            Kwai|   Small|
|      10121|             34|    81.35|              5| 2765.9|  5/7/2003 0:00|Shipped|     2|       5|   2003|Motorcycles|  95|   S10_1678|  Reims Collectables|      26.47.1555|  59 rue de l'Abbaye|        NULL|        Reims| NULL|     51100| France|     EMEA|        Henriot|            Paul|   Small|
|      10134|             41|    94.74|              2|3884.34|  7/1/2003 0:00|Shipped|     3|       7|   2003|Motorcycles|  95|   S10_1678|     Lyon Souveniers|+33 1 46 62 7555|27 rue du Colonel...|        NULL|        Paris| NULL|     75508| France|     EMEA|       Da Cunha|          Daniel|  Medium|
|      10145|             45|    83.26|              6| 3746.7| 8/25/2003 0:00|Shipped|     3|       8|   2003|Motorcycles|  95|   S10_1678|   Toys4GrownUps.com|      6265557265|  78934 Hillside Dr.|        NULL|     Pasadena|   CA|     90003|    USA|       NA|          Young|           Julie|  Medium|
|      10159|             49|    100.0|             14|5205.27|10/10/2003 0:00|Shipped|     4|      10|   2003|Motorcycles|  95|   S10_1678|Corporate Gift Id...|      6505551386|     7734 Strong St.|        NULL|San Francisco|   CA|      NULL|    USA|       NA|          Brown|           Julie|  Medium|
|      10168|             36|    96.66|              1|3479.76|10/28/2003 0:00|Shipped|     4|      10|   2003|Motorcycles|  95|   S10_1678|Technics Stores Inc.|      6505556809|   9408 Furth Circle|        NULL|   Burlingame|   CA|     94217|    USA|       NA|         Hirano|            Juri|  Medium|
|      10180|             29|    86.13|              9|2497.77|11/11/2003 0:00|Shipped|     4|      11|   2003|Motorcycles|  95|   S10_1678|Daedalus Designs ...|      20.16.1555|184, chausse de T...|        NULL|        Lille| NULL|     59000| France|     EMEA|          Rance|         Martine|   Small|
|      10188|             48|    100.0|              1|5512.32|11/18/2003 0:00|Shipped|     4|      11|   2003|Motorcycles|  95|   S10_1678|        Herkku Gifts|   +47 2267 3215|Drammen 121, PR 7...|        NULL|       Bergen| NULL|    N 5804| Norway|     EMEA|         Oeztan|          Veysel|  Medium|
|      10201|             22|    98.57|              2|2168.54| 12/1/2003 0:00|Shipped|     4|      12|   2003|Motorcycles|  95|   S10_1678|     Mini Wheels Co.|      6505555787|5557 North Pendal...|        NULL|San Francisco|   CA|      NULL|    USA|       NA|         Murphy|           Julie|   Small|
|      10211|             41|    100.0|             14|4708.44| 1/15/2004 0:00|Shipped|     1|       1|   2004|Motorcycles|  95|   S10_1678|    Auto Canal Petit|  (1) 47.55.6555|   25, rue Lauriston|        NULL|        Paris| NULL|     75016| France|     EMEA|        Perrier|       Dominique|  Medium|
+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+-----+----------+-------+---------+---------------+----------------+--------+
only showing top 10 rows

In [25]:
df_sales.printSchema()

root
 |-- ORDERNUMBER: integer (nullable = true)
 |-- QUANTITYORDERED: integer (nullable = true)
 |-- PRICEEACH: double (nullable = true)
 |-- ORDERLINENUMBER: integer (nullable = true)
 |-- SALES: double (nullable = true)
 |-- ORDERDATE: string (nullable = true)
 |-- STATUS: string (nullable = true)
 |-- QTR_ID: integer (nullable = true)
 |-- MONTH_ID: integer (nullable = true)
 |-- YEAR_ID: integer (nullable = true)
 |-- PRODUCTLINE: string (nullable = true)
 |-- MSRP: integer (nullable = true)
 |-- PRODUCTCODE: string (nullable = true)
 |-- CUSTOMERNAME: string (nullable = true)
 |-- PHONE: string (nullable = true)
 |-- ADDRESSLINE1: string (nullable = true)
 |-- ADDRESSLINE2: string (nullable = true)
 |-- CITY: string (nullable = true)
 |-- STATE: string (nullable = true)
 |-- POSTALCODE: string (nullable = true)
 |-- COUNTRY: string (nullable = true)
 |-- TERRITORY: string (nullable = true)
 |-- CONTACTLASTNAME: string (nullable = true)
 |-- CONTACTFIRSTNAME: string (nullable = true)
 |-- DEALSIZE: string (nullable = true)

In [26]:
df_sales.createOrReplaceTempView('sales_sql')

In [27]:
df_sales.show()

+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+--------+----------+---------+---------+---------------+----------------+--------+
|ORDERNUMBER|QUANTITYORDERED|PRICEEACH|ORDERLINENUMBER|  SALES|      ORDERDATE| STATUS|QTR_ID|MONTH_ID|YEAR_ID|PRODUCTLINE|MSRP|PRODUCTCODE|        CUSTOMERNAME|           PHONE|        ADDRESSLINE1|ADDRESSLINE2|         CITY|   STATE|POSTALCODE|  COUNTRY|TERRITORY|CONTACTLASTNAME|CONTACTFIRSTNAME|DEALSIZE|
+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+--------+----------+---------+---------+---------------+----------------+--------+
|      10107|             30|     95.7|              2| 2871.0| 2/24/2003 0:00|Shipped|     1|       2|   2003|Motorcycles|  95|   S10_1678|   Land of Toys Inc.|      2125557818|897 Long Airport ...|        NULL|          NYC|      NY|     10022|      USA|       NA|             Yu|            Kwai|   Small|
|      10121|             34|    81.35|              5| 2765.9|  5/7/2003 0:00|Shipped|     2|       5|   2003|Motorcycles|  95|   S10_1678|  Reims Collectables|      26.47.1555|  59 rue de l'Abbaye|        NULL|        Reims|    NULL|     51100|   France|     EMEA|        Henriot|            Paul|   Small|
|      10134|             41|    94.74|              2|3884.34|  7/1/2003 0:00|Shipped|     3|       7|   2003|Motorcycles|  95|   S10_1678|     Lyon Souveniers|+33 1 46 62 7555|27 rue du Colonel...|        NULL|        Paris|    NULL|     75508|   France|     EMEA|       Da Cunha|          Daniel|  Medium|
|      10145|             45|    83.26|              6| 3746.7| 8/25/2003 0:00|Shipped|     3|       8|   2003|Motorcycles|  95|   S10_1678|   Toys4GrownUps.com|      6265557265|  78934 Hillside Dr.|        NULL|     Pasadena|      CA|     90003|      USA|       NA|          Young|           Julie|  Medium|
|      10159|             49|    100.0|             14|5205.27|10/10/2003 0:00|Shipped|     4|      10|   2003|Motorcycles|  95|   S10_1678|Corporate Gift Id...|      6505551386|     7734 Strong St.|        NULL|San Francisco|      CA|      NULL|      USA|       NA|          Brown|           Julie|  Medium|
|      10168|             36|    96.66|              1|3479.76|10/28/2003 0:00|Shipped|     4|      10|   2003|Motorcycles|  95|   S10_1678|Technics Stores Inc.|      6505556809|   9408 Furth Circle|        NULL|   Burlingame|      CA|     94217|      USA|       NA|         Hirano|            Juri|  Medium|
|      10180|             29|    86.13|              9|2497.77|11/11/2003 0:00|Shipped|     4|      11|   2003|Motorcycles|  95|   S10_1678|Daedalus Designs ...|      20.16.1555|184, chausse de T...|        NULL|        Lille|    NULL|     59000|   France|     EMEA|          Rance|         Martine|   Small|
|      10188|             48|    100.0|              1|5512.32|11/18/2003 0:00|Shipped|     4|      11|   2003|Motorcycles|  95|   S10_1678|        Herkku Gifts|   +47 2267 3215|Drammen 121, PR 7...|        NULL|       Bergen|    NULL|    N 5804|   Norway|     EMEA|         Oeztan|          Veysel|  Medium|
|      10201|             22|    98.57|              2|2168.54| 12/1/2003 0:00|Shipped|     4|      12|   2003|Motorcycles|  95|   S10_1678|     Mini Wheels Co.|      6505555787|5557 North Pendal...|        NULL|San Francisco|      CA|      NULL|      USA|       NA|         Murphy|           Julie|   Small|
|      10211|             41|    100.0|             14|4708.44| 1/15/2004 0:00|Shipped|     1|       1|   2004|Motorcycles|  95|   S10_1678|    Auto Canal Petit|  (1) 47.55.6555|   25, rue Lauriston|        NULL|        Paris|    NULL|     75016|   France|     EMEA|        Perrier|       Dominique|  Medium|
|      10223|             37|    100.0|              1|3965.66| 2/20/2004 0:00|Shipped|     1|       2|   2004|Motorcycles|  95|   S10_1678|Australian Collec...|    03 9520 4555|   636 St Kilda Road|     Level 3|    Melbourne|Victoria|      3004|Australia|     APAC|       Ferguson|           Peter|  Medium|
|      10237|             23|    100.0|              7|2333.12|  4/5/2004 0:00|Shipped|     2|       4|   2004|Motorcycles|  95|   S10_1678|     Vitachrome Inc.|      2125551500|   2678 Kingston Rd.|   Suite 101|          NYC|      NY|     10022|      USA|       NA|          Frick|         Michael|   Small|
|      10251|             28|    100.0|              2|3188.64| 5/18/2004 0:00|Shipped|     2|       5|   2004|Motorcycles|  95|   S10_1678|Tekni Collectable...|      2015559350|       7476 Moss Rd.|        NULL|       Newark|      NJ|     94019|      USA|       NA|          Brown|         William|  Medium|
|      10263|             34|    100.0|              2|3676.76| 6/28/2004 0:00|Shipped|     2|       6|   2004|Motorcycles|  95|   S10_1678|     Gift Depot Inc.|      2035552570| 25593 South Bay Ln.|        NULL|  Bridgewater|      CT|     97562|      USA|       NA|           King|           Julie|  Medium|
|      10275|             45|    92.83|              1|4177.35| 7/23/2004 0:00|Shipped|     3|       7|   2004|Motorcycles|  95|   S10_1678|   La Rochelle Gifts|      40.67.8555|67, rue des Cinqu...|        NULL|       Nantes|    NULL|     44000|   France|     EMEA|        Labrune|          Janine|  Medium|
|      10285|             36|    100.0|              6|4099.68| 8/27/2004 0:00|Shipped|     3|       8|   2004|Motorcycles|  95|   S10_1678|Marta's Replicas Co.|      6175558555| 39323 Spinnaker Dr.|        NULL|    Cambridge|      MA|     51247|      USA|       NA|      Hernandez|           Marta|  Medium|
|      10299|             23|    100.0|              9|2597.39| 9/30/2004 0:00|Shipped|     3|       9|   2004|Motorcycles|  95|   S10_1678|Toys of Finland, Co.|     90-224 8555|       Keskuskatu 45|        NULL|     Helsinki|    NULL|     21240|  Finland|     EMEA|      Karttunen|           Matti|   Small|
|      10309|             41|    100.0|              5|4394.38|10/15/2004 0:00|Shipped|     4|      10|   2004|Motorcycles|  95|   S10_1678|  Baane Mini Imports|      07-98 9555|Erling Skakkes ga...|        NULL|      Stavern|    NULL|      4110|   Norway|     EMEA|     Bergulfsen|           Jonas|  Medium|
|      10318|             46|    94.74|              1|4358.04| 11/2/2004 0:00|Shipped|     4|      11|   2004|Motorcycles|  95|   S10_1678|Diecast Classics ...|      2155551555|    7586 Pompton St.|        NULL|    Allentown|      PA|     70267|      USA|       NA|             Yu|           Kyung|  Medium|
|      10329|             42|    100.0|              1|4396.14|11/15/2004 0:00|Shipped|     4|      11|   2004|Motorcycles|  95|   S10_1678|   Land of Toys Inc.|      2125557818|897 Long Airport ...|        NULL|          NYC|      NY|     10022|      USA|       NA|             Yu|            Kwai|  Medium|
+-----------+---------------+---------+---------------+-------+---------------+-------+------+--------+-------+-----------+----+-----------+--------------------+----------------+--------------------+------------+-------------+--------+----------+---------+---------+---------------+----------------+--------+
only showing top 20 rows

### Tabelas dimensionais

In [28]:
# Tabela de datas
calendar = spark.sql('''
                  SELECT DISTINCT ORDERDATE, QTR_ID, MONTH_ID, YEAR_ID
                  FROM sales_sql
                  ORDER BY ORDERDATE

''')
calendar.createOrReplaceTempView('calendar')

calendar.show(5)

+--------------+------+--------+-------+
|     ORDERDATE|QTR_ID|MONTH_ID|YEAR_ID|
+--------------+------+--------+-------+
|1/10/2003 0:00|     1|       1|   2003|
|1/10/2005 0:00|     1|       1|   2005|
|1/12/2004 0:00|     1|       1|   2004|
|1/12/2005 0:00|     1|       1|   2005|
|1/15/2004 0:00|     1|       1|   2004|
+--------------+------+--------+-------+
only showing top 5 rows

In [29]:
# Tabela de vendas/pedidos
orders = spark.sql('''
                  SELECT DISTINCT ORDERNUMBER, CUSTOMERNAME, QUANTITYORDERED, SALES, PRICEEACH, PRODUCTCODE, ORDERLINENUMBER
                  FROM sales_sql
                  ORDER BY ORDERNUMBER

''')

orders.createOrReplaceTempView('orders')

orders.show(5)

+-----------+--------------------+---------------+-------+---------+-----------+---------------+
|ORDERNUMBER|        CUSTOMERNAME|QUANTITYORDERED|  SALES|PRICEEACH|PRODUCTCODE|ORDERLINENUMBER|
+-----------+--------------------+---------------+-------+---------+-----------+---------------+
|      10100|Online Diecast Cr...|             22|1903.22|    86.51|   S18_4409|              4|
|      10100|Online Diecast Cr...|             50| 3390.0|     67.8|   S18_2248|              2|
|      10100|Online Diecast Cr...|             49|1689.03|    34.47|   S24_3969|              1|
|      10100|Online Diecast Cr...|             30| 5151.0|    100.0|   S18_1749|              3|
|      10101|Blauer See Auto, Co.|             26|3773.38|    100.0|   S18_2795|              1|
+-----------+--------------------+---------------+-------+---------+-----------+---------------+
only showing top 5 rows

In [30]:
# Tabela de clientes
customer = spark.sql('''
                  SELECT DISTINCT CUSTOMERNAME, PHONE, ADDRESSLINE1, ADDRESSLINE2, CITY, STATE, POSTALCODE, COUNTRY, TERRITORY
                  FROM sales_sql
                  ORDER BY CUSTOMERNAME

''')

customer.createOrReplaceTempView('customer')

customer.show(5)

+--------------------+--------------+--------------------+------------+------------+-----+----------+---------+---------+
|        CUSTOMERNAME|         PHONE|        ADDRESSLINE1|ADDRESSLINE2|        CITY|STATE|POSTALCODE|  COUNTRY|TERRITORY|
+--------------------+--------------+--------------------+------------+------------+-----+----------+---------+---------+
|      AV Stores, Co.|(171) 555-1555|   Fauntleroy Circus|        NULL|  Manchester| NULL|   EC2 5NT|       UK|     EMEA|
|        Alpha Cognac|    61.77.6555|1 rue Alsace-Lorr...|        NULL|    Toulouse| NULL|     31000|   France|     EMEA|
|  Amica Models & Co.|   011-4988555| Via Monte Bianco 34|        NULL|      Torino| NULL|     10100|    Italy|     EMEA|
|Anna's Decoration...|  02 9936 8555|   201 Miller Street|    Level 15|North Sydney|  NSW|      2060|Australia|     APAC|
|   Atelier graphique|    40.32.2555|      54, rue Royale|        NULL|      Nantes| NULL|     44000|   France|     EMEA|
+--------------------+--------------+--------------------+------------+------------+-----+----------+---------+---------+
only showing top 5 rows

In [31]:
print(calendar.count())
print(orders.count())
print(customer.count())

252
2823
92

### Tabela master

In [32]:
master = spark.sql('''
                SELECT *
                FROM orders o
                INNER JOIN customer c on o.CUSTOMERNAME = c.CUSTOMERNAME                 
''')

print(master.count())
master.show(5)

2823
+-----------+--------------------+---------------+-------+---------+-----------+---------------+--------------------+----------------+--------------------+------------+------------+-----+----------+-------+---------+
|ORDERNUMBER|        CUSTOMERNAME|QUANTITYORDERED|  SALES|PRICEEACH|PRODUCTCODE|ORDERLINENUMBER|        CUSTOMERNAME|           PHONE|        ADDRESSLINE1|ADDRESSLINE2|        CITY|STATE|POSTALCODE|COUNTRY|TERRITORY|
+-----------+--------------------+---------------+-------+---------+-----------+---------------+--------------------+----------------+--------------------+------------+------------+-----+----------+-------+---------+
|      10308|       Mini Classics|             20| 4570.4|    100.0|   S10_4698|              1|       Mini Classics|      9145554562|3758 North Pendal...|        NULL|White Plains|   NY|     24067|    USA|       NA|
|      10272|Diecast Classics ...|             35| 5818.4|    100.0|   S12_1108|              2|Diecast Classics ...|      2155551555|    7586 Pompton St.|        NULL|   Allentown|   PA|     70267|    USA|       NA|
|      10219|Signal Collectibl...|             48|4891.68|    100.0|   S12_4473|              2|Signal Collectibl...|      4155554312|   2793 Furth Circle|        NULL|    Brisbane|   CA|     94217|    USA|       NA|
|      10346|  Signal Gift Stores|             42|1516.62|    36.11|   S18_1342|              3|  Signal Gift Stores|      7025551838|     8489 Strong St.|        NULL|   Las Vegas|   NV|     83030|    USA|       NA|
|      10356|     Lyon Souveniers|             27|1746.63|    64.69|   S18_1984|              2|     Lyon Souveniers|+33 1 46 62 7555|27 rue du Colonel...|        NULL|       Paris| NULL|     75508| France|     EMEA|
+-----------+--------------------+---------------+-------+---------+-----------+---------------+--------------------+----------------+--------------------+------------+------------+-----+----------+-------+---------+
only showing top 5 rows

In [33]:
master = spark.sql('''
                SELECT DISTINCT o.ORDERNUMBER, C.CITY
                FROM orders o
                INNER JOIN customer c on o.CUSTOMERNAME = c.CUSTOMERNAME                 
''')

print(master.count())
master.show(5)

307
+-----------+----------+
|ORDERNUMBER|      CITY|
+-----------+----------+
|      10300| Frankfurt|
|      10385|San Rafael|
|      10182|San Rafael|
|      10140|Burlingame|
|      10241|Strasbourg|
+-----------+----------+
only showing top 5 rows